%Дрибноход Евгений задание практикум по алгебре
%% задание 1
A=[3.25 -1.07 2.34;10.10 0.25 -4.78;5.04 -7.79 3.31]

%%
%задание 2
B=rand(3)

%%
%задание 3
Ans1 = A+(10*B)
Ans2 = A*B
Ans3 = B'
%%
%задание 4
detB = det(B)
%%
% задание 5
C=zeros(3,1);
C(2,1)=5.71;
C(3,1)=-3.61
%%
%Задание 6
X=A\C
%%
%Задание 7
syms x;
solve(det([2*cos(x) 1;1 2*sin(x)]))
%%
% Здание 8a
A=[2 -1 -1;-1 2 1;3 -5 -2];
b=[3;0;1];
xa=zeros(3,1);
for i= 1:3
   Ai=A;
   Ai(:,i)=b;
 xa(i,1)=det(Ai)/det(A);
end
xa
%%
%Задание 8b
A=[2 1 0;1 0 3;5 0 -1];
b=[5;16;10];
xb=zeros(3,1);
for i= 1:3
   Ai=A;
   Ai(:,i)=b;
 xb(i,1)=det(Ai)/det(A);
end
xb
%%
%Задание 9

A=[1 1 1; 1 3 1; 1 1 3];
b=[2;4;0];
C=[A,b];
D=rref(C);
xTest9=D(:,end)
%%
%Задание 10
A=[0 -2; 1 -3];
B=[5 1; -1 0];
E=eye(2);
Ans10 = (3*B)^2-2*(B*(A^(-1))-E)'
%%
%Задание 11

A=[
3.81 0.28 1.28 0.75
2.25 1.32 4.58 0.49
5.31 6.38 0.98 1.04
9.39 2.45 3.35 2.28];

b=[ 1
    1
    1
    1];

[L,U]=lu(A);
xNum11=U\(L\b)
test = A*xNum11

%%
%Задание 12
A=rand(10,8);
xNum12=A(end,end-1)
%%
%Задание 13
A=[1 -1 3
    2 1 -4
    3 1 -3];
b=[8
    -4
    1];
Ans13=A\b
%%